app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "likes", "comments", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["caption", "first post"], ["likes", nil], ["comments", nil], ["created_at", "2023-12-09 11:42:51.559436"], ["updated_at", "2023-12-09 11:42:51.559436"], ["user_id", 23]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    puts "user with post = #{@post.user.email}"


    if @post.save

UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2023-12-09 11:42:51.936189"], ["id", 1]]
---
  def like
    @post.likes += 1
    @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]
---
  def set_post
    @post = Post.find(params[:id])