app/controllers/profile_controller.rb

  def create
    puts "before user detail"
    @user_detail = UserDetail.new(user_detail_params)
    puts "user detail = #{@user_detail}"
    puts "before saving"
    if @user_detail.save
---
INSERT INTO "user_details" ("name", "userName", "DOB", "email", "gender", "mobile", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"